In [15]:
import pandas as pd

In [19]:
# Read csv file
gittis = pd.read_csv(r"C:\\Users\\rhawkins\\Downloads\\Downloaded_CSVs\\deactivated_hotspots.csv")
mitchell = pd.read_csv(r'C:\\Users\\rhawkins\\Downloads\\Downloaded_CSVs\\DO_Server_Room_Verizon_Hotspots_Verizon.csv')

In [20]:
gittis

                  ESN  Unnamed: 1  GITTIS
0     352165100378137         NaN     NaN
1     353057103855329         NaN     NaN
2     356640114026258         NaN     NaN
3     356640114030797         NaN     NaN
4     356640114034732         NaN     NaN
...               ...         ...     ...
1563  356640115452255         NaN     NaN
1564  356640115452271         NaN     NaN
1565  356640115452305         NaN     NaN
1566  356640115452396         NaN     NaN
1567  357244102647123         NaN     NaN

[1568 rows x 3 columns]

In [21]:
mitchell

     Number             IMEI  Unnamed: 2  Unnamed: 3  MITCHELL
0         1  356640114303962         NaN         NaN       NaN
1         2  356640115437058         NaN         NaN       NaN
2         3  356640114304382         NaN         NaN       NaN
3         4  356640115435755         NaN         NaN       NaN
4         5  356640115433768         NaN         NaN       NaN
..      ...              ...         ...         ...       ...
136     137  356640115091939         NaN         NaN       NaN
137     138  356640115092291         NaN         NaN       NaN
138     139  356640115212600         NaN         NaN       NaN
139     140  356640115447396         NaN         NaN       NaN
140     141  356640115163126         NaN         NaN       NaN

[141 rows x 5 columns]

In [ ]:
#Read only the column named 'ESN' store it in a list
imei_1 = []
for column in f1:
    imei_1.append(column['ESN'])

In [9]:
df_1 = pd.DataFrame(imei_1)

In [16]:
df_1.head(10)

                 0
0  352165100378137
1  353057103855329
2  356640114026258
3  356640114030797
4  356640114034732
5  356640114057709
6  356640114078853
7  356640114080891
8  356640114161220
9  356640114193520

In [12]:
#Read only the column named 'IMEI' store it in a list
imei_2 = []
for column in list2:
    imei_2.append(column['IMEI'])

In [13]:
df_2 = pd.DataFrame(imei_2)

In [15]:
df_2.head(10)

                 0
0  356640114303962
1  356640115437058
2  356640114304382
3  356640115435755
4  356640115433768
5  356640115207105
6  356640115193412
7  356640115443031
8  356640114659587
9  356640115124144

In [17]:
#Compare the values of two lists output the similarity store it in a list
imei_3 = []
for column in imei_1:
    if column in imei_2:
        if column is not imei_3:
            imei_3.append(column)

In [18]:
#Test the new list
df_3 = pd.DataFrame(imei_3)

In [19]:
df_3.head(10)

                 0
0  356640114303962
1  356640114330163
2  356640114333134
3  356640114506416
4  356640114614129
5  356640114624532
6  356640114625836
7  356640114632618
8  356640114632907
9  356640114634598

In [20]:
df_3.describe()

                      0
count                49
unique               49
top     356640114303962
freq                  1

In [7]:
#Create a csv file
file = open('C:/Users/rhawkins/Downloads/Downloaded_CSVs/district_working_hotspots.csv', 'w', newline='')

In [8]:
#Write to the csv file
outputWriter = csv.writer(file, delimiter='\n')
outputWriter.writerow(['IMEI'])
outputWriter.writerow([imei_3])
file.close()